package ru.goodsReview.analyzer.wordAnalyzer;

/*
    Date: 26.11.11
    Time: 15:17
    Author: 
        Yaroslav Skudarnov 
        SkudarnovYI@gmail.com
*/

import java.util.StringTokenizer;

public class AdjectiveAnalyzerTest {
    public static void main (String[] args) {
        String testPhrases = "Предел функции (предельное значение функции) в заданной точке, предельной для области определения функции, — такая величина, к которой стремится рассматриваемая функция при стремлении её аргумента к данной точке." +
                "Предел функции является обобщением понятия предела последовательности: изначально, под пределом функции в точке понимали предел последовательности элементов области значений функции, составленной из образов точек последовательности элементов области определения функции, сходящейся к заданной точке (предел в которой рассматривается); если такой предел существует, то говорят, что функция сходится к указанному значению; если такого предела не существует, то говорят, что функция расходится." +
                "Наиболее часто определение предела функции формулируют на языке окрестностей. То, что предел функции рассматривается только в точках, предельных для области определения функции, означает, что в каждой окрестности данной точки есть точки области определения; это позволяет говорить о стремлении аргумента функции (к данной точке). Но предельная точка области определения не обязана принадлежать самой области определения: например, можно рассматривать предел функции на концах открытого интервала, на котором определена функция (сами концы интервала в область определения не входят)." +
                "В общем случае необходимо точно указывать способ сходимости функции, для чего вводят т.н. базу подмножеств области определения функции, и тогда формулируют определение предела функции по (заданной) базе. В этом смысле система проколотых окрестностей данной точки — частный случай такой базы множеств." +
                "Поскольку на расширенной вещественной прямой можно построить базу окрестностей бесконечно удалённой точки, то оказывается допустимым описание предела функции при стремлении аргумента к бесконечности, а, также, описание ситуации, когда функция сама стремится к бесконечности (в заданной точке). Предел последовательности (как предел функции натурального аргумента), как раз предоставляет пример сходимости по базе «стремление аргумента к бесконечности»." +
                "Отсутствие предела функции (в данной точке) означает, что для любого заранее заданного значения области значений и всякой его окрестности сколь угодно близко от заданной точки существуют точки, значение функции в которых окажется за пределами заданной окрестности. Если в некоторой точке области определения функции существует предел и этот предел равен значению в данной функции, то функция оказывается непрерывной (в данной точке)." +
                "Предел функции — одно из основных понятий математического анализа.";
        StringTokenizer st = new StringTokenizer(testPhrases," .,-—:;()\'\"\\«»");
        boolean prevWasAdj = false;
        String currToken;
        String prevToken = "123456789";
        while (st.hasMoreTokens()) {
            currToken = st.nextToken().trim();
            if (AdjectiveAnalyzer.isAdjective(currToken)) {
                System.out.println(currToken + " is an adjective!");
            }
        }
    }
}
